#name: "models_pyb"
backend: "python"
max_batch_size: 8

input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [-1, -1, -1]
  },
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [-1, 5]
  }
]
output [
  {
    name: "similarity"
    data_type: TYPE_FP32
    dims: [-1]
  }
]

instance_group [
  {
    kind: KIND_GPU
  }
]